app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
    if @user.save
---
INSERT INTO `users` (`name`, `country`, `state`, `city`, `email`, `subject`, `message`, `created_at`, `updated_at`) VALUES ('', 'AD', 'UP', 'Ghaziabad', 'nadeem42u@gmail.com', 'Need Help', 'Hello I am willing for your membership', '2017-03-19 14:59:31', '2017-03-19 14:59:31')